### The TimeDelta Object

In [1]:
import pandas as pd
import datetime as dt

In [2]:
time_a = pd.Timestamp('2020-03-31 4:35:16 PM')
time_b = pd.Timestamp('2020-03-20 02:15:49 AM')

time_a, time_b

(Timestamp('2020-03-31 16:35:16'), Timestamp('2020-03-20 02:15:49'))

In [3]:
time_a - time_b

Timedelta('11 days 14:19:27')

In [4]:
time_b - time_a

Timedelta('-12 days +09:40:33')

In [5]:
time_delta = [pd.Timedelta(days = 3),
                pd.Timedelta(hours = 3),
                pd.Timedelta(minutes = 3),
                pd.Timedelta(seconds = 3),
                pd.Timedelta(milliseconds = 3)]
time_delta

[Timedelta('3 days 00:00:00'),
 Timedelta('0 days 03:00:00'),
 Timedelta('0 days 00:03:00'),
 Timedelta('0 days 00:00:03'),
 Timedelta('0 days 00:00:00.003000')]

In [6]:
[time_a + pd.Timedelta(days = 3), 
time_a + pd.Timedelta(weeks = 8, days = 3, hours = 12, minutes = 45, seconds = 44)]

[Timestamp('2020-04-03 16:35:16'), Timestamp('2020-05-30 05:21:00')]

In [7]:
time_a + pd.Timedelta("3 days")

Timestamp('2020-04-03 16:35:16')

In [8]:
time_a + pd.Timedelta("2 days 5 hours 6 minutes 4 seconds")

Timestamp('2020-04-02 21:41:20')

### Timedeltas in a Dataset

In [15]:
shipping = pd.read_csv('ecommerce.csv', index_col = 'ID', parse_dates = ['order_date', 'delivery_date'])

In [16]:
shipping.head()

   order_date delivery_date
ID
1  1998-05-24    1999-02-05
2  1992-04-22    1998-03-06
4  1991-02-10    1992-08-26
5  1992-07-21    1997-11-20
7  1993-09-02    1998-06-10

In [27]:
shipping['Delivery Time'] = shipping['delivery_date'] - shipping['order_date']
shipping.head()

   order_date delivery_date Delivery Time
ID
1  1998-05-24    1999-02-05      257 days
2  1992-04-22    1998-03-06     2144 days
4  1991-02-10    1992-08-26      563 days
5  1992-07-21    1997-11-20     1948 days
7  1993-09-02    1998-06-10     1742 days

In [32]:
shipping['Twice as Long'] = shipping['delivery_date'] + shipping['Delivery Time']
shipping.head()

   order_date delivery_date Delivery Time Twice as Long
ID
1  1998-05-24    1999-02-05      257 days    1999-10-20
2  1992-04-22    1998-03-06     2144 days    2004-01-18
4  1991-02-10    1992-08-26      563 days    1994-03-12
5  1992-07-21    1997-11-20     1948 days    2003-03-22
7  1993-09-02    1998-06-10     1742 days    2003-03-18

In [33]:
shipping.dtypes

order_date        datetime64[ns]
delivery_date     datetime64[ns]
Delivery Time    timedelta64[ns]
Twice as Long     datetime64[ns]
dtype: object

In [40]:
"""Difference between 2 datetimes = timedelta. Datetime + DateTime gives a new DateTime and not a TimeDelta. 
TimeDelta comes into the picture only when difference between dates or datetimes are involved."""

shipping[shipping['Delivery Time'] >= "365 days"]

    order_date delivery_date Delivery Time Twice as Long
ID
2   1992-04-22    1998-03-06     2144 days    2004-01-18
4   1991-02-10    1992-08-26      563 days    1994-03-12
5   1992-07-21    1997-11-20     1948 days    2003-03-22
7   1993-09-02    1998-06-10     1742 days    2003-03-18
9   1990-01-25    1994-10-02     1711 days    1999-06-09
..         ...           ...           ...           ...
986 1990-12-10    1992-12-16      737 days    1994-12-23
990 1991-06-24    1996-02-02     1684 days    2000-09-12
991 1991-09-09    1998-03-30     2394 days    2004-10-18
993 1990-11-16    1998-04-27     2719 days    2005-10-06
997 1990-01-04    1991-10-03      637 days    1993-07-01

[394 rows x 4 columns]